{
    "nav":{
        "home":"Strona główna",
        "about": "O mnie",
        "projects": "Projekty",
        "skils": "Umiejętności",
        "contact":"Kontakt"
    },
    "proj":{
        "card":{
            "title":{
                "rekoportal":"RekoPortal",
                "rekoportal-m":"RekoPortal na Androida",
                "goodwire":"Good Wire",
                "gojump":"GO! GO! JUMP!",
                "ai1":"Algorytm Apriori",
                "ai2":"Algorytm decyzyjny",
                "ai3":"Algorytm k najbliższych sąsiadów",
                "pearpair":"Pear Pair",
                "poke":"Poke Invaders",
                "astar":"Algorytm A Star"
            },
            "content":{
                "rekoportal":"Aplikacja webowa portalu społecznościowego dla rekonstruktorów historycznych.",
                "rekoportal-m":"Aplikacja na system Android portalu społeczniościowego dla rekonstruktorów historycznych.",
                "goodwire":"System monitoringu jakości powietrza, wyposarzony w mobilne urzadzenia pomiarowe.",
                "gojump":"Gra  zręcznościowa, mobilna na urządzenia z systemem Android.",
                "ai1":"Implementacja algorytmu eksploracji często używanych zestawów elementów i uczenia reguł asocjacyjnych.",
                "ai2":"Implementacja algorytmu podejmujacego decyzje na podstawie przetwarzanych danych wejściowych.",
                "ai3":"Implementacja algorytmu używany do przewidywania wartości zmiennych losowych i klasyfikacji.",
                "pearpair":"Serwisu randkowego w Angular z API napisanym w ASP.NET Core.",
                "poke":"Gra na system Windows oparta o klasyczną grę Space Invaders.",
                "astar":"Implementacja algorytmu heurystycznego do znajdowania najkrótszej drogi."
            }
        }
    },
    "skills":{
        "title": "Moje umiejętności",
        "text":["Od dawna interesowałem się branża IT oraz technologią. Głównie zajmuje się tworzeniem aplikacji Fronendowych.",
                "Posiadam również umjejętności z zakresu tworzenia aplikacji Backendowych oraz programowania mikrokontrolerów i sterowników PLC."
                ]
    },
    "about": {
        "content":["Informatyką i programowaniem interesowałem się od dziecka",
                " zaczynając od kółka informatycznego w szkole podstawowej oraz uczęszczania do Technikum informatycznego",
                " w którym robiłem pierwsze kroki w programowaniu. Następnym etapem mojej edukacji były studia kieunku Informatyka", 
                " które rozpoczołem w 2015 roku, wtedy też zajołem się bardziej, profesjonalnym programowaniem. Jestem młodą",
                " kreatywną oraz dociekliwa w dobrym tego znaczeniu osobą. Oprócz informatyki ukończyłem również studia magisterskie na kierunku mechatronika. Lubie rozwiązywanie łamigłowek i zagadek",
                " jako poczatkujacy programista interesuje się zagaddnieniami związanymi z programowaniem i technologią."],
        "link-ct":"Więcej o moich zainteresowaniach znajduje sie w dalszej części strony. Kliknij lub przewiń dalej",
        "hobby1":"Oprócz zainteresowań związanych z IT i technologią interesuję się również historią. Od 2014 roku jestem czynnym członkiem grupy rekononstrukcji historycznej ",
        "hobby2":["W wolnej chwili lubie również obejżęć dobry film lub serial. Najczęściej wybierane przezemnie gatunki kina to: filmy akcji, horror", 
                "science fiction oraz filmy dokumentalne. Poza tym o ile pogoda pozwoli lubie odpoczynek na świeżym powietrzu w tym wycieczki rowerowe. Moim hobby jest również róznego rodzaju majsterkowanie."]
    }
}